{"Design With Examples" : {
	"1" : { "year" : "2004", "title" : "Modeling by example", "authors" : "Thomas Funkhouser, Michael Kazhdan, Philip Shilane, Patrick Min, William Kiefer, Ayellet Tal, Szymon Rusinkiewicz, and David Dobkin", "abstract" : "In this paper, we investigate a data-driven synthesis approach to constructing 3D geometric surface models. We provide methods with which a user can search a large database of 3D meshes to find parts of interest, cut the desired parts out of the meshes with intelligent scissoring, and composite them together in different ways to form new objects. The main benefit of this approach is that it is both easy to learn and able to produce highly detailed geometric models -- the conceptual design for new models comes from the user, while the geometric details come from examples in the database. The focus of the paper is on the main research issues motivated by the proposed approach: (1) interactive segmentation of 3D surfaces, (2) shape-based search to find 3D models with parts matching a query, and (3) composition of parts to form new models. We provide new research contributions on all three topics and incorporate them into a prototype modeling system. Experience with our prototype system indicates that it allows untrained users to create interesting and detailed 3D models.", 
        "summary" : "supports users to compose a new shape from pieces on existing furniture models; supports shape searching and interactive segmentation", "image" : "/images/model_by_example.png"},  
    "2" : {"year" : "2004", "title" : "A suggestive interface for image guided 3D sketching", "authors" : "Steve Tsang, Ravin Balakrishnan, Karan Singh, and Abhishek Ranjan", "abstract" : "We present an image guided pen-based suggestive interface for sketching 3D wireframe models. Rather than starting from a blank canvas, existing 2D images of similar objects serve as a guide to the user. Image based filters enable attraction, smoothing, and resampling of input curves, and allows for their selective application using pinning and gluing techniques. New input strokes also invoke suggestions of relevant geometry that can be used, reducing the need to explicitly draw all parts of the new model. All suggestions appear in-place with the model being built, in the user's focal attention space. A curve matching algorithm seamlessly augments basic suggestions with more complex ones from a database populated with previously used geometry. The interface also incorporates gestural command input, and interaction techniques for camera controls that enable smooth transitions between orthographic and perspective views.", 
        "summary" : "integrates existing 2D image to guide users when sketching 3D models", "image" : "/images/image_guided_sketch.png"},
    "3" : {"year" : "2013", "title" : "LandSketch: a first person point-of-view example-based terrain modeling approach", "authors" : "Vladimir Alves dos Passos and Takeo Igarashi", "abstract" : "We present an intuitive interface for easy modeling of terrains, compatible with example-based synthesis approach. The interface consists on a picture's canvas-like screen, where the user sketches silhouettes of mountains, as he would do if drawing mountains on a piece of paper. Realistic results are achieved by combining copies of the example terrain in such a manner that matches the sketched silhouette. We use Digital Elevation Models (DEM) of real world terrains as source data, and a weighted sum function to continually combine the heights.", 
        "summary" : "provides an example based synthesis approach that allows users to sketch silhouettes of mountains via real world terrain models", "image" : "/images/landsketch.png"},
    "4" : {"year" : "2011", "title" : "Interactive furniture layout using interior design guidelines. ", "authors" : "Paul Merrell, Eric Schkufza, Zeyang Li, Maneesh Agrawala, and Vladlen Koltun", "abstract" : "We present an interactive furniture layout system that assists users by suggesting furniture arrangements that are based on interior design guidelines. Our system incorporates the layout guidelines as terms in a density function and generates layout suggestions by rapidly sampling the density function using a hardware-accelerated Monte Carlo sampler. Our results demonstrate that the suggestion generation functionality measurably increases the quality of furniture arrangements produced by participants with no prior training in interior design.", 
        "summary" : "the system suggests furniture layout based on identified interior design guidelines", "image" : "/images/furniture_layout_using_guidelines.png"},
    "5" : {"year" : "2017", "title" : "SweepCanvas: Sketch-based 3D Prototyping on an RGB-D Image.", "authors" : "Yuwei Li, Xi Luo, Youyi Zheng, Pengfei Xu, and Hongbo Fu", "abstract" : "The creation of 3D contents still remains one of the most crucial problems for the emerging applications such as 3D printing and Augmented Reality. In Augmented Reality, how to create virtual contents that seamlessly overlay with the real environment is a key problem for human-computer interaction and many subsequent applications. In this paper, we present a sketch-based interactive tool, which we term emph{SweepCanvas}, for rapid exploratory 3D modeling on top of an RGB-D image. Our aim is to offer end-users a simple yet efficient way to quickly create 3D models on an image. We develop a novel sketch-based modeling interface, which takes a pair of user strokes as input and instantly generates a curved 3D surface by sweeping one stroke along the other. A key enabler of our system is an optimization procedure that extracts pairs of spatial planes from the context to position and sweep the strokes. We demonstrate the effectiveness and power of our modeling system on various RGB-D data sets and validate the use cases via a pilot study.", 
        "summary" : "sketch based prototyping exploiting contextual information", "image" : "/images/sweepcanvas.png"}    
    },

    "Exploratory Design Tool" : {
        "1" : {"year" : "2001", "title" : "A suggestive interface for 3D drawing", "authors" : "Takeo Igarashi and John F. Hughes", "abstract" : "This paper introduces a new type of interface for 3D drawings that improves the usability of gestural interfaces and augments typical command-based modeling systems. In our suggestive interface, the user gives hints about a desired operation to the system by highlighting related geometric components in the scene. The system then infers possible operations based on the hints and presents the results of these operations as small thumbnails. The user completes the editing operation simply by clicking on the desired thumbnail. The hinting mechanism lets the user specify geometric relations among graphical components in the scene, and the multiple thumbnail suggestions make it possible to define many operations with relatively few distinct hint patterns. The suggestive interface system is implemented as a set of suggestion engines working in parallel, and is easily extended by adding customized engines. Our prototype 3D drawing system, Chateau, shows that a suggestive interface can effectively support construction of various 3D drawings.", 
            "summary" : "infers possible next operatons based on hints provided by users", "image" : "/images/suggestive_interface.png"},
        "2" : {"year" : "2012", "title" : "Guided Exploration of Physically Valid Shapes for Furniture Design", "authors" : "Nobuyuki Umetani, Takeo Igarashi, and Niloy J. Mitra", "abstract" : "Geometric modeling and the physical validity of shapes are traditionally considered independently. This makes creating aesthetically pleasing yet physically valid models challenging. We propose an interactive design framework for efficient and intuitive exploration of geometrically and physically valid shapes. During any geometric editing operation, the proposed system continuously visualizes the valid range of the parameter being edited. When one or more constraints are violated after an operation, the system generates multiple suggestions involving both discrete and continuous changes to restore validity. Each suggestion also comes with an editing mode that simultaneously adjusts multiple parameters in a coordinated way to maintain validity. Thus, while the user focuses on the aesthetic aspects of the design, our computational design framework helps to achieve physical realizability by providing active guidance to the user. We demonstrate our framework on plank-based furniture design with nail-joint and frictional constraints. We use our system to design a range of examples, conduct a user study, and also fabricate a physical prototype to test the validity and usefulness of the system.", 
            "summary" : "guided users to explore physically valid shapes suggested by the system", "image" : "/images/guided_furniture.png"},
        "3" : {"year" : "2018", "title" : "Forte: User-Driven Generative Design", "authors" : "Xiang 'Anthony' Chen, Ye Tao, Guanyun Wang, Runchang Kang, Tovi Grossman, Stelian Coros, and Scott E. Hudson", "abstract" : "Low-cost fabrication machines (e.g., 3D printers) offer the promise of creating custom-designed objects by a range of users. To maximize performance, generative design methods such as topology optimization can automatically optimize properties of a design based on high-level specifications. Though promising, such methods require people to map their design ideas--often unintuitively--to a small number of mathematical input parameters, and the relationship between those parameters and a generated design is often unclear, making it difficult to iterate a design. We present Forte, a sketch-based, real-time interactive tool for people to directly express and iterate on their designs via 2D topology optimization. Users can ask the system to add structures, provide a variation with better performance, or optimize internal material layouts. Users can globally control how much to 'deviate' from the initial sketch, or perform local suggestive editing, which interactively prompts the system to update based on the new information. Design sessions with 10 participants demonstrate that Forte empowers designers to create and explore a range of optimized designs with custom forms and styles.", 
            "summary" : "users explore optimizated topology of 3D objects by sketching their intentions", "image" : "/images/forte.png"},
        "4" : {"year" : "2017", "title" : "DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design", "authors" : "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice", "abstract" : "We present DreamSketch, a novel 3D design interface that combines the free-form and expressive qualities of sketching with the computational power of generative design algorithms. In DreamSketch, a user coarsely defines the problem by sketching the design context. Then, a generative design algorithm produces multiple solutions that are augmented as 3D objects in the sketched context. The user can interact with the scene to navigate through the generated solutions. The combination of sketching and generative algorithms enables designers to explore multiple ideas and make better informed design decisions during the early stages of design. Design study sessions with designers and mechanical engineers demonstrate the expressive nature and creative possibilities of DreamSketch.", 
            "summary" : "allows users to express ideas by sketching, and select sysnthesized design solutions computationally resulted from topology optimization", "image" : "/images/dreamsketch.png"}
    },

    
    "Substainable Design": {
        "16" : {"year" : "1101", "title" : "solid", "authors" : "hori-stick", "abstract" : "none", "summary" : "decoration", "image" : "/images/image.png"}
    },


    "Other Interactive 3D Modelling" : {

        "1" : {"year" : "2006", "title" : "SESAME: towards better 3D conceptual design systems", "authors" : "Ji-Young Oh, Wolfgang Stuerzlinger, and John Danahy", "abstract" : "Conceptual design dominates the early stages of most creative design processes. During these stages, the designer makes important decisions about the parameters of a model that are aimed at satisfying a set of design criteria. To do this, the designer produces many sketches of various possible solutions. Meanwhile, computer-aided design (CAD) systems are becoming the dominant visual medium used in design practice. However, these tools evolved as documentation production tools and do not support conceptual thinking. This paper presents a list of guidelines for computer support for conceptual design activities on 3D scenes and presents SESAME (Sketch, Extrude, Sculpt, and Manipulate Easily), a system based on these guidelines. Finally, we present a user study comparing SESAME with a conventional CAD package to demonstrate the effectiveness of SESAME.", 
            "summary" : "facilitates efficient 2D skeching and 3D manipulation to support early conceptual design process", "image" : "/images/sesame.png"}
    }
}