{"Design With Examples (as Reference, Element, or Guidelines)" : {
	"1" : { "year" : "2004", "title" : "Modeling by example", "authors" : "Thomas Funkhouser, Michael Kazhdan, Philip Shilane, Patrick Min, William Kiefer, Ayellet Tal, Szymon Rusinkiewicz, and David Dobkin", "abstract" : "In this paper, we investigate a data-driven synthesis approach to constructing 3D geometric surface models. We provide methods with which a user can search a large database of 3D meshes to find parts of interest, cut the desired parts out of the meshes with intelligent scissoring, and composite them together in different ways to form new objects. The main benefit of this approach is that it is both easy to learn and able to produce highly detailed geometric models -- the conceptual design for new models comes from the user, while the geometric details come from examples in the database. The focus of the paper is on the main research issues motivated by the proposed approach: (1) interactive segmentation of 3D surfaces, (2) shape-based search to find 3D models with parts matching a query, and (3) composition of parts to form new models. We provide new research contributions on all three topics and incorporate them into a prototype modeling system. Experience with our prototype system indicates that it allows untrained users to create interesting and detailed 3D models.", 
        "summary" : "supports users to compose a new shape from pieces on existing furniture models; supports shape searching and interactive segmentation", "image" : "/images/model_by_example.png"},  
    "2" : {"year" : "2004", "title" : "A suggestive interface for image guided 3D sketching", "authors" : "Steve Tsang, Ravin Balakrishnan, Karan Singh, and Abhishek Ranjan", "abstract" : "We present an image guided pen-based suggestive interface for sketching 3D wireframe models. Rather than starting from a blank canvas, existing 2D images of similar objects serve as a guide to the user. Image based filters enable attraction, smoothing, and resampling of input curves, and allows for their selective application using pinning and gluing techniques. New input strokes also invoke suggestions of relevant geometry that can be used, reducing the need to explicitly draw all parts of the new model. All suggestions appear in-place with the model being built, in the user's focal attention space. A curve matching algorithm seamlessly augments basic suggestions with more complex ones from a database populated with previously used geometry. The interface also incorporates gestural command input, and interaction techniques for camera controls that enable smooth transitions between orthographic and perspective views.", 
        "summary" : "integrates existing 2D image to guide users when sketching 3D models", "image" : "/images/image_guided_sketch.png"},
    "3" : {"year" : "2013", "title" : "LandSketch: a first person point-of-view example-based terrain modeling approach", "authors" : "Vladimir Alves dos Passos and Takeo Igarashi", "abstract" : "We present an intuitive interface for easy modeling of terrains, compatible with example-based synthesis approach. The interface consists on a picture's canvas-like screen, where the user sketches silhouettes of mountains, as he would do if drawing mountains on a piece of paper. Realistic results are achieved by combining copies of the example terrain in such a manner that matches the sketched silhouette. We use Digital Elevation Models (DEM) of real world terrains as source data, and a weighted sum function to continually combine the heights.", 
        "summary" : "provides an example based synthesis approach that allows users to sketch silhouettes of mountains via real world terrain models", "image" : "/images/landsketch.png"},
    "4" : {"year" : "2011", "title" : "Interactive furniture layout using interior design guidelines. ", "authors" : "Paul Merrell, Eric Schkufza, Zeyang Li, Maneesh Agrawala, and Vladlen Koltun", "abstract" : "We present an interactive furniture layout system that assists users by suggesting furniture arrangements that are based on interior design guidelines. Our system incorporates the layout guidelines as terms in a density function and generates layout suggestions by rapidly sampling the density function using a hardware-accelerated Monte Carlo sampler. Our results demonstrate that the suggestion generation functionality measurably increases the quality of furniture arrangements produced by participants with no prior training in interior design.", 
        "summary" : "the system suggests furniture layout based on identified interior design guidelines", "image" : "/images/furniture_layout_using_guidelines.png"},
    "5" : {"year" : "2017", "title" : "SweepCanvas: Sketch-based 3D Prototyping on an RGB-D Image.", "authors" : "Yuwei Li, Xi Luo, Youyi Zheng, Pengfei Xu, and Hongbo Fu", "abstract" : "The creation of 3D contents still remains one of the most crucial problems for the emerging applications such as 3D printing and Augmented Reality. In Augmented Reality, how to create virtual contents that seamlessly overlay with the real environment is a key problem for human-computer interaction and many subsequent applications. In this paper, we present a sketch-based interactive tool, which we term emph{SweepCanvas}, for rapid exploratory 3D modeling on top of an RGB-D image. Our aim is to offer end-users a simple yet efficient way to quickly create 3D models on an image. We develop a novel sketch-based modeling interface, which takes a pair of user strokes as input and instantly generates a curved 3D surface by sweeping one stroke along the other. A key enabler of our system is an optimization procedure that extracts pairs of spatial planes from the context to position and sweep the strokes. We demonstrate the effectiveness and power of our modeling system on various RGB-D data sets and validate the use cases via a pilot study.", 
        "summary" : "sketch based prototyping exploiting contextual information", "image" : "/images/sweepcanvas.png"},
    "6" : {"year" : "2018", "title" : "Grafter: Remixing 3D-Printed Machines", "authors" : "Thijs Jan Roumen, Willi Müller, and Patrick Baudisch", "abstract" : "Creating new 3D printed objects by recombining models found in hobbyist repositories has been referred to as remixing. In this paper, we explore how to best support users in remixing a specific class of 3D printed objects, namely those that perform mechanical functions. In our survey, we found that makers remix such machines by manually extracting parts from one parent model and combine it with parts from a different parent model. This approach often puts axles made by one maker into bearings made by another maker or combines a gear by one maker with a gear by a different maker. This approach is problem-atic, however, as parts from different makers tend to fit poorly, which results in long series of tweaks and test-prints until all parts finally work together. We address this with our interactive system grafter. Grafter does two things. First, grafter largely automates the process of extracting and recombining mechanical elements from 3D printed machines. Second, it enforces a more efficient approach to reuse: it prevents users from extracting indi-vidual parts, but instead affords extracting groups of me-chanical elements that already work together, such as axles and their bearings or pairs of gears. We call this mecha-nism-based remixing. In a final user study, all models that participants had remixed using grafter could be 3D printed without further tweaking and worked immediately.", 
        "summary" : "supports users to create new 3D printed objects by extracting and remixing mechanical parts from existing models", "image" : "/images/grafter.png"},
    "7" : {"year" : "2008", "title" : "Hacking, Mashing, Gluing: Understanding Opportunistic Design", "authors" : "Björn Hartmann, Scott Doorley, and Scott R. Klemmer", "abstract" : "Opportunistic practices can accelerate and simplify ubiquitous computing systems design. Such practices may include copying and pasting code from online forums into one's own scripts or reappropriating components from consumer electronics for design prototypes. The authors introduce a framework that links opportunistic design for ubiquitous computing to hardware and software practices. They interview 14 professional and hobbyist mashers—Web 2.0 programmers, hardware hackers, and designers of interactive ubiquitous computing systems—to learn how designers choose between integration levels. Finally, they discover the mashups' epistemic, pragmatic, and intrinsic values for creators and how shopping becomes a central activity.", 
        "summary" : "opportunistic design for ubiquitous computing to hardware and software practices.", "image" : "/images/meshup_design.png"},
    "8" : {"year" : "2009", "title" : "Getting inspired!: understanding how and why examples are used in creative design practice", "authors" : "Scarlett R. Herring, Chia-Chen Chang, Jesse Krantzler, and Brian P. Bailey", "abstract" : "The use of examples serves a critical role in creative design practice, but details of this process remain an enigma. This is problematic for both the understanding of design activity as well as for developing more effective design tools. In this paper, we report results of a study that understands and compares how designers (N=11) utilize, manage, and share examples to support the creative design process. The domains studied were Web, graphic, and product design. Our study shows that examples are a cornerstone of creative practice and are utilized for many reasons throughout the design process. Since examples are pivotal to the success of a project, more effective tools that support retrieval, storage, and dissemination of examples are needed. This paper contributes understanding of the benefits and roles of examples in the design process and implications for the design of more effective tools that support example usage.", 
        "summary" : "examples help scoping what is already available, and inspiring new design ideas", "image" : "/images/getting_inspired.png"},
    "9" : {"year" : "2010", "title" : "Designing with interactive example galleries", "authors" : "Brian Lee, Savil Srivastava, Ranjitha Kumar, Ronen Brafman, and Scott R. Klemmer", "abstract" : "Designers often use examples for inspiration; examples offer contextualized instances of how form and content integrate. Can interactive example galleries bring this practice to everyday users doing design work, and does working with examples help the designs they create? This paper explores whether people can realize significant value from explicit mechanisms for designing by example modification. We present the results of three studies, finding that independent raters prefer designs created with the aid of examples, that examples may benefit novices more than experienced designers, that users prefer adaptively selected examples to random ones, and that users make use of multiple examples when creating new designs. To enable these studies and demonstrate how software tools can facilitate designing with examples, we introduce interface techniques for browsing and borrowing from a corpus of examples, manifest in the Adaptive Ideas Web design tool. Adaptive Ideas leverages a faceted metadata interface for viewing and navigating example galleries.",
        "summary" : "to understand the role that examples can play in design", "image" : "/images/design_with_example.png"},
    "10" : {"year" : "2015", "title" : "Patterns of Physical Design Remixing in Online Maker Communities", "authors" : "Lora Oehlberg, Wesley Willett, and Wendy E. Mackay", "abstract" : "Makers participate in remixing culture by drawing inspiration from, combining, and adapting designs for physical objects. To examine how makers remix each others' designs on a community scale, we analyzed metadata from over 175,000 digital designs from Thingiverse, the largest online design community for digital fabrication. Remixed designs on Thingiverse are predominantly generated designs from Customizer a built-in web app for adjusting parametric designs. However, we find that these designs do not elicit subsequent user activity and the authors who generate them tend not to contribute additional content to Thingiverse. Outside of Customizer, influential sources of remixing include complex assemblies and design primitives, as well as non-physical resources posing as physical designs. Building on our findings, we discuss ways in which online maker communities could become more than just design repositories and better support collaborative remixing.", 
        "summary" : "investigates makers' activities in remixing digital designs for physical objects", "image" : "/images/patterns_physical_design_remixing.png"},
    "11" : {"year" : "2014", "title" : "Design and fabrication by example", "authors" : "Adriana Schulz, Ariel Shamir, David I. W. Levin, Pitchaya Sitthi-amorn, and Wojciech Matusik", "abstract" : "We propose a data-driven method for designing 3D models that can be fabricated. First, our approach converts a collection of expert-created designs to a dataset of parameterized design templates that includes all information necessary for fabrication. The templates are then used in an interactive design system to create new fabri-cable models in a design-by-example manner. A simple interface allows novice users to choose template parts from the database, change their parameters, and combine them to create new models. Using the information in the template database, the system can automatically position, align, and connect parts: the system accomplishes this by adjusting parameters, adding appropriate constraints, and assigning connectors. This process ensures that the created models can be fabricated, saves the user from many tedious but necessary tasks, and makes it possible for non-experts to design and create actual physical objects. To demonstrate our data-driven method, we present several examples of complex functional objects that we designed and manufactured using our system.", 
        "summary" : "creats an assmebling based modelling system for fabrcation; via creating parameter template", "image" : "/images/design_and_fabrication_by_example.png"},
    "12" : {"year" : "2015", "title" : "MetaMorphe: Designing Expressive 3D Models for Digital Fabrication", "authors" : "Cesar Torres and Eric Paulos", "abstract" : "The creative promise of 3D digital fabrication tools is tremendous. However due to the wide range of tools and interfaces, a common static file format called STL is used for sharing designs. While customization tools add creative handles to these digital models, they are often constrained to pre-configured parameters limiting the creative potential of shared digital models. We introduce MetaMorphe, a novel digital fabrication framework that uses a common web-programming metaphor to enable users to easily transform static 3D models into re-formed, re-made, and re-imagined customized personal artifacts. We demonstrate the compatibility of MetaMorphe with three well-established design interfaces, direction manipulation, scripted-CAD, and generative design. Through a user study with design experts, MetaMorphe reveals that decisions that physically produce bespoke artifacts or encode unique metadata actively affect perceptions of authorship, agency, and authenticity. We discuss how expressive model-building tools such as MetaMorphe enable a cultural shift in 3D design in terms of participation, personalization, and creativity.", 
        "summary" : "provides a mix of direct manipulation, script, and generative design interfaces to engage users to edit 3D models creatively", "image" : "/images/metamorphe.png"},
    "13" : {"year" : "2016", "title" : "Reprise: A Design Tool for Specifying, Generating, and Customizing 3D Printable Adaptations on Everyday Objects", "authors" : "Xiang 'Anthony' Chen, Jeeeun Kim, Jennifer Mankoff, Tovi Grossman, Stelian Coros, and Scott E. Hudson", "abstract" : "Everyday tools and objects often need to be customized for an unplanned use or adapted for specific user, such as adding a bigger pull to a zipper or a larger grip for a pen. The advent of low-cost 3D printing offers the possibility to rapidly construct a wide range of such adaptations. However, while 3D printers are now affordable enough for even home use, the tools needed to design custom adaptations normally require skills that are beyond users with limited 3D modeling experience. In this paper, we describe Reprise--a design tool for specifying, generating, customizing and fitting adaptations onto existing household objects. Reprise allows users to express at a high level what type of action is applied to an object. Based on this high level specification, Reprise automatically generates adaptations. Users can use simple sliders to customize the adaptations to better suit their particular needs and preferences, such as increasing the tightness for gripping, enhancing torque for rotation, or making a larger base for stability. Finally, Reprise provides a toolkit of fastening methods and support structures for fitting the adaptations onto existing objects. To validate our approach, we used Reprise to replicate 15 existing adaptation examples, each of which represents a specific category in a design space distilled from an analysis of over 3000 cases found in the literature and online communities. We believe this work would benefit makers and designers for prototyping lifehacking solutions and assistive technologies.", 
        "summary" : "derives a library of adaptation strategies; a tool to support users design and customize the objects using the library", "image" : "/images/reprise.png"},
    "14" : {"year" : "2018", "title" : "Medley: A Library of Embeddables to Explore Rich Material Properties for 3D Printed Objects", "authors" : "Xiang 'Anthony' Chen, Stelian Coros, and Scott E. Hudson", "abstract" : "In our everyday life, we interact with and benefit from objects with a wide range of material properties. In contrast, personal fabrication machines (e.g., desktop 3D printers) currently only support a much smaller set of materials. Our goal is to close the gap between current limitations and the future of multi-material printing by enabling people to explore the reuse of material from everyday objects into their custom designs. To achieve this, we develop a library of embeddables--everyday objects that can be cut, worked and embedded into 3D printable designs. We describe a design space that characterizes the geometric and material properties of embeddables. We then develop Medley---a design tool whereby users can import a 3D model, search for embeddables with desired material properties, and interactively edit and integrate their geometry to fit into the original design. Medley also supports the final fabrication and embedding process, including instructions for carving or cutting the objects, and generating optimal paths for inserting embeddables. To validate the expressiveness of our library, we showcase numerous examples augmented by embeddables that go beyond the objects' original printed materials.",
        "summary" : "summarizes a categorization of everyday embeddables' geometric and material properties; use them to support custom design with various material properties", "image" : "/images/medley.png"},
    "15" : {"year" : "2018", "title" : "Rewire: Interface Design Assistance from Examples", "authors" : "Amanda Swearngin, Mira Dontcheva, Wilmot Li, Joel Brandt, Morgan Dixon, and Andrew J. Ko", "abstract" : "Interface designers often use screenshot images of example designs as building blocks for new designs. Since images are unstructured and hard to edit, designers typically reconstruct screenshots with vector graphics tools in order to reuse or edit parts of the design. Unfortunately, this reconstruction process is tedious and slow. We present Rewire, an interactive system that helps designers leverage example screenshots. Rewire automatically infers a vector representation of screenshots where each UI component is a separate object with editable shape and style properties. Based on this representation, the system provides three design assistance modes that help designers reuse or redraw components of the example design. The results from our quantitative and user evaluations demonstrate that Rewire can generate accurate vector representations of interface screenshots found in the wild and that design assistance enables users to reconstruct and edit example designs more efficiently compared to a baseline design tool.", 
        "summary" : "automatically infers a vetor representations of screenshots to be reused in new interface design", "image" : "/images/rewire.png"},
    "16" : {"year" : "2017", "title" : "Trigger-Action-Circuits: Leveraging Generative Design to Enable Novices to Design and Build Circuitry", "authors" : "Fraser Anderson, Tovi Grossman, and George Fitzmaurice", "abstract" : "The dramatic decrease in price and increase in availability of hobbyist electronics has led to a wide array of embedded and interactive devices. While electronics have become more widespread, developing and prototyping the required circuitry for these devices is still difficult, requiring knowledge of electronics, components, and programming. In this paper, we present Trigger-Action-Circuits (TAC), an interactive system that leverages generative design to produce circuitry, firmware, and assembly instructions, based on high-level, behavioural descriptions. TAC is able to generate multiple candidate circuits from a behavioural description, giving the user a number of alternative circuits that may be best suited to their use case (e.g., based on cost, component availability or ease of assembly). The generated circuitry uses off-the-shelf, commodity electronics, not specialized hardware components, enabling scalability and extensibility. TAC supports a range of common components and behaviors that are frequently required for prototyping electronic circuits. A user study demonstrated that TAC helps users avoid problems encountered during circuit design and assembly, with users completing their circuits significantly faster than with traditional methods.", 
        "summary" : "suggests a variety of candidate circuits using a database of components based on users' highlevel intentions", "image" : "/images/trigger_action_circuit.png"}          

    },

    "Exploratory Design Tool" : {
        "1" : {"year" : "2001", "title" : "A suggestive interface for 3D drawing", "authors" : "Takeo Igarashi and John F. Hughes", "abstract" : "This paper introduces a new type of interface for 3D drawings that improves the usability of gestural interfaces and augments typical command-based modeling systems. In our suggestive interface, the user gives hints about a desired operation to the system by highlighting related geometric components in the scene. The system then infers possible operations based on the hints and presents the results of these operations as small thumbnails. The user completes the editing operation simply by clicking on the desired thumbnail. The hinting mechanism lets the user specify geometric relations among graphical components in the scene, and the multiple thumbnail suggestions make it possible to define many operations with relatively few distinct hint patterns. The suggestive interface system is implemented as a set of suggestion engines working in parallel, and is easily extended by adding customized engines. Our prototype 3D drawing system, Chateau, shows that a suggestive interface can effectively support construction of various 3D drawings.", 
            "summary" : "infers possible next operatons based on hints provided by users", "image" : "/images/suggestive_interface.png"},
        "2" : {"year" : "2012", "title" : "Guided Exploration of Physically Valid Shapes for Furniture Design", "authors" : "Nobuyuki Umetani, Takeo Igarashi, and Niloy J. Mitra", "abstract" : "Geometric modeling and the physical validity of shapes are traditionally considered independently. This makes creating aesthetically pleasing yet physically valid models challenging. We propose an interactive design framework for efficient and intuitive exploration of geometrically and physically valid shapes. During any geometric editing operation, the proposed system continuously visualizes the valid range of the parameter being edited. When one or more constraints are violated after an operation, the system generates multiple suggestions involving both discrete and continuous changes to restore validity. Each suggestion also comes with an editing mode that simultaneously adjusts multiple parameters in a coordinated way to maintain validity. Thus, while the user focuses on the aesthetic aspects of the design, our computational design framework helps to achieve physical realizability by providing active guidance to the user. We demonstrate our framework on plank-based furniture design with nail-joint and frictional constraints. We use our system to design a range of examples, conduct a user study, and also fabricate a physical prototype to test the validity and usefulness of the system.", 
            "summary" : "guided users to explore physically valid shapes suggested by the system", "image" : "/images/guided_furniture.png"},
        "3" : {"year" : "2018", "title" : "Forte: User-Driven Generative Design", "authors" : "Xiang 'Anthony' Chen, Ye Tao, Guanyun Wang, Runchang Kang, Tovi Grossman, Stelian Coros, and Scott E. Hudson", "abstract" : "Low-cost fabrication machines (e.g., 3D printers) offer the promise of creating custom-designed objects by a range of users. To maximize performance, generative design methods such as topology optimization can automatically optimize properties of a design based on high-level specifications. Though promising, such methods require people to map their design ideas--often unintuitively--to a small number of mathematical input parameters, and the relationship between those parameters and a generated design is often unclear, making it difficult to iterate a design. We present Forte, a sketch-based, real-time interactive tool for people to directly express and iterate on their designs via 2D topology optimization. Users can ask the system to add structures, provide a variation with better performance, or optimize internal material layouts. Users can globally control how much to 'deviate' from the initial sketch, or perform local suggestive editing, which interactively prompts the system to update based on the new information. Design sessions with 10 participants demonstrate that Forte empowers designers to create and explore a range of optimized designs with custom forms and styles.", 
            "summary" : "users explore optimizated topology of 3D objects by sketching their intentions", "image" : "/images/forte.png"},
        "4" : {"year" : "2017", "title" : "DreamSketch: Early Stage 3D Design Explorations with Sketching and Generative Design", "authors" : "Rubaiat Habib Kazi, Tovi Grossman, Hyunmin Cheong, Ali Hashemi, and George Fitzmaurice", "abstract" : "We present DreamSketch, a novel 3D design interface that combines the free-form and expressive qualities of sketching with the computational power of generative design algorithms. In DreamSketch, a user coarsely defines the problem by sketching the design context. Then, a generative design algorithm produces multiple solutions that are augmented as 3D objects in the sketched context. The user can interact with the scene to navigate through the generated solutions. The combination of sketching and generative algorithms enables designers to explore multiple ideas and make better informed design decisions during the early stages of design. Design study sessions with designers and mechanical engineers demonstrate the expressive nature and creative possibilities of DreamSketch.", 
            "summary" : "allows users to express ideas by sketching, and select sysnthesized design solutions computationally resulted from topology optimization", "image" : "/images/dreamsketch.png"}
    },

    
    "Substainable Design on Existing Objects": {
        "1" : {"year" : "2015", "title" : "AutoConnect: computational design of 3D-printable connectors", "authors" : "Yuki Koyama, Shinjiro Sueda, Emma Steinhardt, Takeo Igarashi, Ariel Shamir, and Wojciech Matusik", "abstract" : "We present AutoConnect, an automatic method that creates customized, 3D-printable connectors attaching two physical objects together. Users simply position and orient virtual models of the two objects that they want to connect and indicate some auxiliary information such as weight and dimensions. Then, AutoConnect creates several alternative designs that users can choose from for 3D printing. The design of the connector is created by combining two holders, one for each object. We categorize the holders into two types. The first type holds standard objects such as pipes and planes. We utilize a database of parameterized mechanical holders and optimize the holder shape based on the grip strength and material consumption. The second type holds free-form objects. These are procedurally generated shell-gripper designs created based on geometric analysis of the object. We illustrate the use of our method by demonstrating many examples of connectors and practical use cases.", 
            "summary" : "performs geometric and force analysis given existing objects and provides potentional designs that connect the two input objects", "image" : "/images/autoconnector.png"},
        "2" : {"year" : "2015", "title" : "Encore: 3D Printed Augmentation of Everyday Objects with Printed-Over, Affixed and Interlocked Attachments", "authors" : "Xiang 'Anthony' Chen, Stelian Coros, Jennifer Mankoff, and Scott E. Hudson", "abstract" : "One powerful aspect of 3D printing is its ability to extend, repair, or more generally modify everyday objects. However, nearly all existing work implicitly assumes that whole objects are to be printed from scratch. Designing objects as extensions or enhancements of existing ones is a laborious process in most of today's 3D authoring tools. This paper presents a framework for 3D printing to augment existing objects that covers a wide range of attachment options. We illustrate the framework through three exemplar attachment techniques -- print-over, print-to-affix and print-through, implemented in Encore, a design tool that supports a set of analysis metrics relating to viability, durability and usability that are visualized for the user to explore design options and tradeoffs. Encore also generates 3D models for production, addressing issues such as support jigs and contact geometry between the attached part and the original object. Our validation helps to illustrate the strengths and weaknesses of each technique. For example, print-over is stronger than print-to-affix with adhesives, and all the techniques' strengths are affected by surface curvature.", 
            "summary" : "designed print-over, print-to-affix, print-through techniques to augment everyday object with attachment", "image" : "/images/encore.png"},
        "3" : {"year" : "2015", "title" : "Patching Physical Objects", "authors" : "Alexander Teibrich, Stefanie Mueller, François Guimbretière, Robert Kovacs, Stefan Neubert, and Patrick Baudisch", "abstract" : "Personal fabrication is currently a one-way process: Once an object has been fabricated with a 3D printer, it cannot be changed anymore; any change requires printing a new version from scratch. The problem is that this approach ignores the nature of design iteration, i.e. that in subsequent iterations large parts of an object stay the same and only small parts change. This makes fabricating from scratch feel unnecessary and wasteful. In this paper, we propose a different approach: instead of re-printing the entire object from scratch, we suggest patching the existing object to reflect the next design iteration. We built a system on top of a 3D printer that accomplishes this: Users mount the existing object into the 3D printer, then load both the original and the modified 3D model into our software, which in turn calculates how to patch the object. After identifying which parts to remove and what to add, our system locates the existing object in the printer using the system's built-in 3D scanner. After calibrating the orientation, a mill first removes the outdated geometry, then a print head prints the new geometry in place. Since only a fraction of the entire object is refabricated, our approach reduces material consumption and plastic waste (for our example objects by 82% and 93% respectively).", 
            "summary" : "a framework to print directly on existing objects", "image" : "/images/patching_physical_object.png"},
        "4" : {"year" : "2017", "title" : "Reconfigurable interlocking furniture", "authors" : "Peng Song, Chi-Wing Fu, Yueming Jin, Hongfei Xu, Ligang Liu, Pheng-Ann Heng, and Daniel Cohen-Or.", "abstract" : "Reconfigurable assemblies consist of a common set of parts that can be assembled into different forms for use in different situations. Designing these assemblies is a complex problem, since it requires a compatible decomposition of shapes with correspondence across forms, and a planning of well-matched joints to connect parts in each form. This paper presents computational methods as tools to assist the design and construction of reconfigurable assemblies, typically for furniture. There are three key contributions in this work. First, we present the compatible decomposition as a weakly-constrained dissection problem, and derive its solution based on a dynamic bipartite graph to construct parts across multiple forms; particularly, we optimize the parts reuse and preserve the geometric semantics. Second, we develop a joint connection graph to model the solution space of reconfigurable assemblies with part and joint compatibility across different forms. Third, we formulate the backward interlocking and multi-key interlocking models, with which we iteratively plan the joints consistently over multiple forms. We show the applicability of our approach by constructing reconfigurable furniture of various complexities, extend it with recursive connections to generate extensible and hierarchical structures, and fabricate a number of results using 3D printing, 2D laser cutting, and woodworking.", 
            "summary" : "a tool to assist the design and construction of recon gurable furniture from a given set of 3D designs", "image" : "/images/reconfigurable_design.png"},
        "5" : {"year" : "2016", "title" : "RetroFab: A Design Tool for Retrofitting Physical Interfaces using Actuators, Sensors and 3D Printing.", "authors" : "Raf Ramakers, Fraser Anderson, Tovi Grossman, and George Fitzmaurice", "abstract" : "We present RetroFab, an end-to-end design and fabrication environment that allows non-experts to retrofit physical interfaces. Our approach allows for changing the layout and behavior of physical interfaces. Unlike customizing software interfaces, physical interfaces are often challenging to adapt because of their rigidity. With RetroFab, a new physical interface is designed that serves as a proxy interface for the legacy controls that are now operated by actuators. RetroFab makes this concept of retrofitting devices available to non-experts by automatically generating an enclosure structure from an annotated 3D scan. This enclosure structure holds together actuators, sensors as well as components for the redesigned interface. To allow retrofitting a wide variety of legacy devices, the RetroFab design tool comes with a toolkit of 12 components. We demonstrate the versatility and novel opportunities of our approach by retrofitting five domestic objects and exploring their use cases. Preliminary user feedback reports on the experience of retrofitting devices with RetroFab.", 
            "summary" : "retrofit physical interfaces with a set of actuators and sensors, and automatic enclosure design and print", "image" : "/images/retrofab.png"},
        
        "16" : {"year" : "1111", "title" : "solid", "authors" : "hori", "abstract" : "none", "summary" : "decoration", "image" : "/images/image.png"}
    },


    "Other Interactive 3D Modelling" : {
        "1" : {"year" : "2006", "title" : "SESAME: towards better 3D conceptual design systems", "authors" : "Ji-Young Oh, Wolfgang Stuerzlinger, and John Danahy", "abstract" : "Conceptual design dominates the early stages of most creative design processes. During these stages, the designer makes important decisions about the parameters of a model that are aimed at satisfying a set of design criteria. To do this, the designer produces many sketches of various possible solutions. Meanwhile, computer-aided design (CAD) systems are becoming the dominant visual medium used in design practice. However, these tools evolved as documentation production tools and do not support conceptual thinking. This paper presents a list of guidelines for computer support for conceptual design activities on 3D scenes and presents SESAME (Sketch, Extrude, Sculpt, and Manipulate Easily), a system based on these guidelines. Finally, we present a user study comparing SESAME with a conventional CAD package to demonstrate the effectiveness of SESAME.", 
            "summary" : "facilitates efficient 2D skeching and 3D manipulation to support early conceptual design process", "image" : "/images/sesame.png"},
        "2" : {"year" : "2016", "title" : "Dynamic furniture modeling through assembly instructions", "authors" : "Tianjia Shao, Dongping Li, Yuliang Rong, Changxi Zheng, and Kun Zhou", "abstract" : "We present a technique for parsing widely used furniture assembly instructions, and reconstructing the 3D models of furniture components and their dynamic assembly process. Our technique takes as input a multi-step assembly instruction in a vector graphic format and starts to group the vector graphic primitives into semantic elements representing individual furniture parts, mechanical connectors (e.g., screws, bolts and hinges), arrows, visual highlights, and numbers. To reconstruct the dynamic assembly process depicted over multiple steps, our system identifies previously built 3D furniture components when parsing a new step, and uses them to address the challenge of occlusions while generating new 3D components incrementally. With a wide range of examples covering a variety of furniture types, we demonstrate the use of our system to animate the 3D furniture assembly process and, beyond that, the semantic-aware furniture editing as well as the fabrication of personalized furnitures.", 
            "summary" : "parsing widely used furniture assembly instructions, and reconstructing the 3D models of furniture com-ponents and their dynamic assembly", "image" : "/images/modeling_through_assembly_instructions.png"}
    }
}